'''
Дано 2 числа a и b. Используя форматирование строк,
выведите на экран их сумму и произведение в форматах ’a + b = c’ и ’a*b = c’.
'''

a = 3
b = 5
print(f"{a} + {b} = {a + b}\n{a} * {b} = {a * b}")
