'''
Дана строка. Напишите программу удаления символов, которые имеют нечетные значения индекса заданной строки.
'''

a = '0123456789'
print(a[::2])